study/net/cert/networkplus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Network+</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Network+</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd9f2741">Resources</a></li>
<li><a href="#orgc07f296">Info</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd9f2741" class="outline-2">
<h2 id="orgd9f2741">Resources</h2>
</div>
<div id="outline-container-orgc07f296" class="outline-2">
<h2 id="orgc07f296">Info</h2>
<div class="outline-text-2" id="text-orgc07f296">
<p>
<b>Best Resources</b>:
</p>
<ul class="org-ul">
<li><b>Book</b>: <i>All-in-One CompTIA Network+</i>
<ul class="org-ul">
<li>Take notes of all that is reffered to in the test.</li>
<li>Monday to Friday one hour study (8:30 - 12:00)</li>
</ul></li>
<li><b>Course</b>: <i>Udemy CompTIA Network+ (N10-008) by Jason Dion</i> (CRITICAL)
<ul class="org-ul">
<li>Everytime you get score under 90 try again.</li>
</ul></li>
<li><b>Youtube Videos</b>: <a href="https://youtube.com/playlist?list=PLG49S3nxzAnlCJiCrOYuRYb6cne864a7G&amp;si=x-KFb9XRqGCcD3Lp">Professor Messer Network+ Training</a></li>
<li><b>Youtube Videos</b>: <a href="https://youtube.com/playlist?list=PLjOaIaJsY_GM91trVgixrYDxgZXWoy5aN&amp;si=2NOGO-c4hnsJNip2">Network+ Study by Vincent Humble</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
